Revit 2027 API
IFCCategoryTemplate.GetCategoryMappingTable Method
 Gets the table that contains a mapping from Revit categories to IFC entities.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<ExportIFCCategoryKey, ExportIFCCategoryInfo> GetCategoryMappingTable(
	Document document
)
Public Function GetCategoryMappingTable (
	document As Document
) As IDictionary(Of ExportIFCCategoryKey, ExportIFCCategoryInfo)
public:
IDictionary<ExportIFCCategoryKey^, ExportIFCCategoryInfo^>^ GetCategoryMappingTable(
	Document^ document
)
member GetCategoryMappingTable :
        document : Document -> IDictionary<ExportIFCCategoryKey, ExportIFCCategoryInfo>
Parameters
document Document
 The document.
Return Value
IDictionary<ExportIFCCategoryKey, ExportIFCCategoryInfo>
 The mapping table.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace